12/data/attachments/110e2e98fa7da397.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_969af944-d2f4-4ef0-a2bb-438e86edbf98</nif:username>
            <nif:friendToBeAdded>Nancy_letter_Friend_31808_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>